Revit 2027 API
ThermalAsset.ThermalConductivity Property
 The thermal conductivity of the asset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ThermalConductivity { get; set; }
Public Property ThermalConductivity As Double
	Get
	Set
public:
property double ThermalConductivity {
	double get ();
	void set (double value);
}
member ThermalConductivity : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for thermalConductivity must be non-negative.
Remarks
 Values are in feet-kilograms per Kelvin-cubed-second ((ft · kg)/(K · s³)) and must be non-negative.
See Also
Reference
ThermalAsset Class
Autodesk.Revit.DB Namespace